caseBM/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.1;

vertices        
(
    (0 0 -0.05)
    (1 0 -0.05)
    (1 1 -0.05)
    (0 1 -0.05)
    (0 0 0.05)
    (1 0 0.05)
    (1 1 0.05)
    (0 1 0.05)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    axis
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    wedge_pos
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    wedge_neg
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    walls
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
);

mergePatchPairs 
(
);


// ************************************************************************* //
